Repository: Marticat/finalka
Catalog: lib/l10n/app_*.arb
Languages: kk

source: Home
kk: Басты

source: Community
kk: Қауымдастық

source: Trainings
kk: Жаттығулар

source: Food
kk: Тамақ

source: Map
kk: Карта

source: Account
kk: Аккаунт

source: Exercise types
kk: Жаттығу түрлері

source: Gym near me
kk: Жақын жаттықтыру залдары

# communityActivity
source: Community's Activity
kk: Қауымдастық белсенділігі

source: Add to training
kk: Жаттығуға қосу

source: Workout Plan
kk: Жаттығу жоспары

source: Workout Details
kk: Жаттығу мәліметтері

source: Superset
kk: Суперсет

source: With Rest
kk: Демалыспен

source: Workout Plan Name
kk: Жоспар атауы

source: Select Workout Date
kk: Күнді таңдаңыз

source: Select Start Time
kk: Уақытты таңдаңыз

source: Exercise Summary
kk: Жаттығулар тізімі

source: Accept plan
kk: Жоспарды қабылдау

source: Planned exercises
kk: Жоспарланған жаттығулар

source: Find Gyms Nearby
kk: Жақын жаттықтыру залдарын табу

source: Your Location
kk: Сіздің орналасқан жеріңіз

# searchLocation
source: Search for a location (e.g., Astana)
kk: Орналасқан жеріңізді іздеу (мысалы, Астана)

# addressCopied
source: Address copied to clipboard
kk: Мекенжай көшірілді

source: Welcome to GymFit
kk: GymFit қосымшасына қош келдіңіз

source: Password
kk: Құпия сөз

source: Login
kk: Кіру

source: Sign Up
kk: Тіркелу

source: Create new account
kk: Жаңа аккаунт ашу

# alreadyHaveAccount
source: I already have an account
kk: Аккаунтым бар

source: Or sign in with:
kk: Немесе келесі арқылы кіріңіз:

source: Authentication failed
kk: Аутентификация сәтсіз аяқталды

source: Settings
kk: Баптаулар

source: Language
kk: Тіл

source: English
kk: Ағылшын

source: Russian
kk: Орыс

source: Kazakh
kk: Қазақ

source: Dark Mode
kk: Қараңғы тема

source: Light Mode
kk: Ашық тема

source: Theme
kk: Тема

source: Color
kk: Түс

source: Decrease Cart Count
kk: Санын азайту

source: Increase Cart Count
kk: Санын көбейту

source: Please enable location services
kk: Локация қызметтерін қосыңыз

# locationPermissionsDenied
source: Location permissions are denied
kk: Локацияға рұқсат жоқ

# locationPermissionsPermanentlyDenied
source: Location permissions are permanently denied
kk: Локацияға рұқсат түпкілікті жоқ

source: Error getting location
kk: Орналасқан жерді алу қатесі

source: Error getting address
kk: Мекенжайды алу қатесі

source: No results found for
kk: Еш нәтиже табылмады

source: Error searching location
kk: Орналасқан жерді іздеу қатесі

source: Add Planned Exercise
kk: Жоспарланған жаттығу қосу

source: Exercise Name
kk: Жаттығу атауы

source: Required
kk: Міндетті

source: Calories
kk: Калориялар

source: Duration
kk: Ұзақтығы

source: Category
kk: Санат

source: Difficulty
kk: Қиындық

source: Cancel
kk: Бас тарту

source: Add
kk: Қосу

source: Edit Exercise
kk: Жаттығуды өңдеу

source: Save
kk: Сақтау

source: Workout Progress
kk: Жаттығу прогрессі

source: Start adding exercises
kk: Жаттығуларды қосуды бастаңыз

source: exercises planned
kk: жаттығу жоспарланған

source: Your Stats
kk: Сіздің статистикаңыз

source: Total Exercises
kk: Жаттығулар саны

source: Total Duration
kk: Жалпы ұзақтық

source: Total Calories
kk: Жалпы калориялар

source: My Profile
kk: Менің профилім

# pleaseEnterValidEmail
source: Please enter a valid email
kk: Жарамды email енгізіңіз

source: Password must be at least 6 characters
kk: Құпия сөз кемінде 6 таңбадан тұруы керек
